Revit 2027 API
FilterableValueProvider.GetStringValue Method
 Gets a string value from the given element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetStringValue(
	Element element
)
Public Function GetStringValue (
	element As Element
) As String
public:
String^ GetStringValue(
	Element^ element
)
member GetStringValue :
        element : Element -> string
Parameters
element Element
 The element to query.
Return Value
String
 The string value from the element.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FilterableValueProvider Class
Autodesk.Revit.DB Namespace